jeswin_test1/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 -0.01);

boundaryField
{
    wall
    {
        type            noSlip;
    }

    symmetry
    {
        type            symmetry;
    }

    pipe
    {
        type            noSlip;
    }

    inlet
    {
        type            fixedValue;
	value		uniform (0 0.05 0);	// Re = 5000 for u(inlet) = 0.05 m/s
    }

    outlet
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
