jeswin_test1/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 300;

boundaryField
{
    
    wall
    {
        type            zeroGradient;
    }

    symmetry
    {
        type            symmetry;
    }

    pipe
    {
        type            fixedValue;	// pipe has constant T 
        value           uniform 500;
    }
		
    inlet
    {
        type            fixedValue;	// fluid at inlet has constant T
        value           uniform 300;
    }

    outlet
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
