jeswin_test1/0/alphat
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      alphat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0.15e-6;

boundaryField
{
    wall
    {
        type            zeroGradient;
    }

    symmetry
    {
        type            symmetry;
    }
	
    pipe
    {         
        type            alphatJayatillekeWallFunction;
        Prt             0.85;
        value           uniform 0.15e-6;
    }

    inlet
    {         
        type            zeroGradient;
    }

    outlet
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
